# -*- coding: utf-8 -*-
bot_name = "Имя бота"  # имя бота !!!кавычки оставить
group_id = 000000000  # id группы, менять только цифры
linkongroup = f"vk.com/club000000000".replace(".com", ".me")  # ссылка на группу такого же формата  !!!кавычки оставить
vk_token = ""  # настройки группы - работа с api - создать ключ  !!!кавычки оставить
vk_token_user = ""  # https://www.youtube.com/watch?v=2eiPf-DfZBE&t=500s&ab_channel=WhyNot  !!!кавычки оставить
qiwi_token = ""  # https://qiwi.com/p2p-admin/api  !!!кавычки оставить
double_chat_ids = [4, 5, 6, 7, 8, 9]  # чтобы узнать id бесед с даблом в существующей беседе напишите //chat_id

businesses = {"Сервер в Minecraft": {"cost": 10000, "salary": 400},
              "Продажа палёных вещей": {"cost": 200000, "salary": 4000},
              "Ночной клуб": {"cost": 3000000, "salary": 10000},
              "Магазин электронных сигарет": {"cost": 7000000, "salary": 50000},
              "Кальянная": {"cost": 15000000, "salary": 100000},
              "Бордель": {"cost": 2500000000, "salary": 60000000},
              "Торговля оружием": {"cost": 10000000000, "salary": 120000000},
              "Межпланетарный экспресс": {"cost": 2500000000000000, "salary": 150000000000},
              "Колонизация марса": {"cost": 500000000000000, "salary": 600000000000},
              "Адронный колайдер": {"m": 1500, "salary": 2500000000 * 80}}

hairstyles = {"Лысый": {"money": 0}, "Блондин вверх": {"money": 10000000}, "Брюнет-кудряш": {"money": 10000000},
              "Красный модник": {"money": 1000000000000000}, "Синие бабские": {"money": 10000000},
              "Зеленый панк": {"money": 100000000000000},
              "Блондин набок": {"money": 10000000}, "Фанат моргенштерна": {"money": 25000000000000},
              "Face": {"money": 3000000000000000},
              "Гомер Симпсон": {"money": 300}, "Ананас": {"money": 50000000000000}, "Хохолок": {"money": 0},
              "1000-7": {"money": 1000000},
              "Баклажан «FULL HD 8K»": {"money": 35000000000000}, "Блошиный «FULL HD 8K»": {"gb": 300000},
              "Бледный «FULL HD 8K»": {"gb": 300000}, "Камелопардовый «FULL HD 8K»": {"gb": 300000}}

tattoes = {"Ничего": {"money": 0}, "666": {"money": 100000000000000}, "Hate Love": {"money": 250000000000000},
           "xui": {"gb": 100000},
           "Сердце": {"gb": 50000}, "Доллар": {"gb": 10000}}

heads = {"Ничего": {"money": 0}, "Голубая шапка": {"gb": 250000}, "Шляпа Etro": {"money": 150000000},
         "Шляпа Gucci": {"money": 10000000000000},
         "Кепка Gucci": {"money": 2000000000000000}, "Кепка Doshirak": {"gb": 5000},
         "Розовые ушки": {"money": 3000000000000},
         "Шапка Спартак": {"money": 150000000000000}, "Бандана": {"money": 10000000}, "Медицинская маска": {"money": 5},
         "Пиксельные очки": {"money": 15000000}, "Шапка McSankcii": {"money": 1000000000000},
         "Кепка МакДональдс": {"money": 1000000000000},
         "Строительная каска": {"money": 500000000000000}, "Шапка с кошечкой": {"money": 20000000},
         "Шапка Reebok": {"money": 10000000},
         "PoliceMan": {"money": 15000000000000}}

tshorts = {"Ничего": {"money": 0}, "Футболка Adidas": {"money": 1000000000}, "Футболка Балтика": {"money": 5000000000},
           "Футболка БЕЗ БАБ!": {"money": 1000000000000}, "Футболка Brawl Stars": {"money": 30},
           "Футболка Gucci": {"money": 5000000000000000},
           "Футболка Nike Black": {"gb": 5000000}, "Футболка Nike White": {"gb": 1000000}, "Памперс": {"gb": 1000},
           "Футболка Россия": {"money": 10}, "Футболка Supreme": {"gb": 10000},
           "Футболка Thrasher": {"money": 30000000000000},
           "Victoria Secret": {"money": 300}, "Hentai2baby": {"money": 5000000000000}, "Senpai Boobs": {"gb": 50000},
           "Waifu Black": {"money": 10000000000000}, "Hentai Black": {"money": 30000000000},
           "Hentai Red": {"money": 30000000000},
           "Hentai White": {"money": 30000000000}}

costumes = {"Ничего": {"money": 0}, "Мелконян": {"money": 5000000}, "Пуси": {"gb": 2500000},
            "ФК Горилла": {"money": 1000000000000000}, "Клоун": {"gb": 250000}, "Джейсон Стэтхем": {"gb": 250000},
            "Полупокер": {"gb": 500000},
            "Бандит": {"gb": 500000}, "Питерский модник": {"money": 3000000000000000}}

shoes = {"Ничего": {"money": 0}, "Balenciaga Triple S": {"money": 300000000000000},
         "Adidas Foam": {"money": 1000000000},
         "Nike Air Jordan": {"gb": 2000000}, "Тапки Versace": {"gb": 500000},
         "Versace Chain Reaction": {"money": 100000000000000},
         "Adidas Yeezy 350": {"money": 200000000000000}, "Adidas Yeezy 500": {"money": 300000000000000},
         "Adidas Yeezy 700": {"money": 100000000000},
         "Versace Trigreca Black": {"money": 100000000000}, "Versace Trigreca Red": {"money": 10000000000000000},
         "Versace Trigreca Green": {"money": 30000000000}}

accessories = {"Ничего": {"money": 0}, "Nokia 3310": {"money": 30000000000}, "Автомат": {"money": 10000000000000},
               "Балтика-9": {"money": 1000000000},
               "Бигмак": {"money": 135000000000000}, "Dildo-1": {"gb": 5000000}, "Dildo-2": {"money": 100000000000000},
               "iPhone": {"money": 200000000000000},
               "Нож бабочка": {"gb": 10000000}}

farms = {"asic": {"cost": 5000000, "btc": 1, "name": "ASIC Miner"},
         "dragonmintt1": {"cost": 60000000, "btc": 3, "name": "DRAGONMINT T1"},
         "fm2018bt400": {"cost": 700000000, "btc": 25, "name": "FM2018-BT400"},
         "genesis": {"cost": 9000000000, "btc": 500, "name": "Genesis Mining"},
         "gigawatt": {"cost": 800000000000, "btc": 3000, "name": "GigaWatt"},
         "gorilla": {"cost": 1600000000000, "btc": 5000, "name": "Gorilla Mining"}}

printers = {"Canon PIXMA": {"cost": 10000000000, "salary": 250000000},
            "HP OfficeJet Pro": {"cost": 50000000000, "salary": 1000000000},
            "Xerox Phaser 7800DN": {"cost": 400000000000, "salary": 5000000000},
            "Epson SureLab": {"cost": 1000000000000, "salary": 10000000000},
            "HP Color LaserJet": {"cost": 220000000000000, "salary": 120000000000}}

jokes = [
    "Анекдот:\nУважаемые пассажиры! Полет нашего лайнера подходит к концу. У вас есть еще время, чтобы попрощаться друг"
    " с другом.", "Анекдот:\nВ трамвае.\n-Бабушка, хотите сесть на мое место?\n-Спасибо, не против бы.\n-Тогда не отход"
                  "ите, через три остановки я выхожу.",
    "Анекдот:\nПриезжает молодой офицер в часть - такая глухомань, кругом степь, "
    "ни души.\n- Как у вас тут с женщинами, - спрашивает местных служивых офицеров.\n- Ой, до женщин тут очень далеко, "
    "зато есть верблюд!\nДелать нечего, идет офицер верблюда естествовать, возвращается, и говорит:\n- Верблюд хорошо, "
    "но женщина лучше.\n- Ну вот, на нем-то мы за женщинами и ездим!", "Анекдот:\nЗвонит девушка на радио и говорит:\n-"
                                                                       " Вчера нашла кошелёк, там было 5 тысяч долларов, 618 марок и визитка на имя Гарика Марикяна, проспект Шверника, 19"
                                                                       "... Поставьте ему, пожалуйста, какую-нибудь хорошую песню!",
    "Анекдот:\nДоктор долго осматривал пациента и никак н"
    "е мог определить, чем он болен. Наконец он глубокомысленно произнес:\n- Идите домой, примите горячую ванную, а пот"
    "ом погуляйте часок-другой без пальто.\n- И вы полагаете, это поможет?\n- Нет, но вы почти наверняка получите воспа"
    "ление легких, а его мы легко распознаем и успешно лечим.", "Анекдот:\n- Вас эротические сны не мучают?\n- Нет, док"
                                                                "тор, только они и радуют...",
    "Анекдот:\nЕврейская мама говорит сыну:\n- Изя, первая жена у тебя должна быть еврей"
    "ка. Во-первых, ты еврей. Во-вторых, еврейка-жена - это связи и блат. У вас будет настоящая семья, дети, хороший, п"
    "равильный дом. Ты займёшь положение в обществе, дети вырастут, получат образование... Ну, а вторая жена должна быт"
    "ь русская или хохлушка.\n- Но почему? Я же еврей.\n- Русские и хохлушки - красивые, вкусно готовят, страстные. Вы "
    "будете путешествовать, развлекаться. С ней ты будешь чувствовать себя настоящим мужчиной... А потом ты разведёшься"
    " и женишься на латышке.\n- Почему?!\n- Ой, сынок, если б ты знал, как они за могилками ухаживают!", "Анекдот:\n- Н"
                                                                                                         "ет, яуж лучше умру, чем соглашусь на вашу операцию!\n- Не горячитесь! Одно другому не мешает.",
    "Анекдот:\nЕсли те"
    "бя ударили по правой щеке, то подставь левую... затем уйди под локоть и снизу в челюсть.", "Анекдот:\nЧебурашка кр"
                                                                                                "окодилу Гене:\n- Ген, давай я возьму чемодан, а ты возьмешь меня...\n- Ну иди сюда, мой маленький извращенец...",
    "Анекдот:\nПациент доктору:\n- Как уберечься от СПИДа?\n- Есть хороший способ. Надо надеть презерватив, смазать его"
    " подсолнечным маслом, надеть второй, смазать йодом, сверху забинтовать, смазать эпоксидной смолой. И главное - ник"
    "аких половых контактов.", "Анекдот:\nДети - цветы жизни! Продаю семена!", "Анекдот:\nВ купе сидят двое. Один дремл"
                                                                               "ет, другой с карандашом в руках разгадывает кроссворд. Тот, что разгадывает кроссворд, спрашивает:\n- Извините, Вы"
                                                                               " не знаете твердого цилиндрического продолговатого предмета из трех букв, заканчивающегося на ..й?\n- Конечно знаю"
                                                                               ", это кий.\n- Извините, а у Вас резиночки не найдется?",
    "Анекдот:\n- Товарищи курсанты, ваши фамилии?\n- Иванов, "
    "Петров, Сидоров!\n- Вы что, братья?\n- Нет, однофамильцы.", "Анекдот:\n(В американских газетах под именем Абби выс"
                                                                 "тупает журналистка - консультант по женским проблемам. Женщины откровенно ей пишут под псевдонимами, и газеты публ"
                                                                 "икуют вопросы и ответы).\nДорогая Абби, Мой муж лгун и изменщик. Он изменял мне с самого начала. Я потеряла счет ж"
                                                                 "енщинам, с которыми он имел секс. Когда я припираю его к стенке - он все отрицает. Хуже всего то, что все знают, ч"
                                                                 "то он мне изменяет. Это так унизительно! А еще, с тех пор как он потерял работу два года назад, он даже не искал д"
                                                                 "ругую. Все, что он делает - это сидит в нижнем белье перед телевизором, пока я работаю, чтобы оплачивать жизнь. Те"
                                                                 "перь, когда дочь покинула дом, он даже не изображает любовь ко мне. Он все время обзывает меня лесбиянкой. Что мне"
                                                                 " делать? Растерянная из Нью-Йорка\nДорогая Растерянная, Да бросьте вы его. Вы теперь сенатор от штата Нью-Йорк. На"
                                                                 "хрена он вам нужен. Абби",
    "Анекдот:\nПациент доктору:\n- Как уберечься от СПИДа?\n- Есть хороший способ. Надо над"
    "еть презерватив, смазать его подсолнечным маслом, надеть второй, смазать йодом, сверху забинтовать, смазать эпокси"
    "дной смолой. И главное - никаких половых контактов.", "Анекдот:\nПациент доктору:\n- Как уберечься от СПИДа?\n- Ес"
                                                           "ть хороший способ. Надо надеть презерватив, смазать его подсолнечным маслом, надеть второй, смазать йодом, сверху "
                                                           "забинтовать, смазать эпоксидной смолой. И главное - никаких половых контактов.",
    "Анекдот:\n- Принесите мне, пожал"
    "уйста, графинчик водочки и что-нибудь на ваш вкус.\n- Так и запишем: два графинчика водочки.", "Анекдот:\nИдут пар"
                                                                                                    "ень с девушкой\n-Что молчишь?\n-Хочу и молчу.\n-ХОЧЕШЬ и МОЛЧИШЬ???!!!",
    "Анекдот:\nБыла рыбка простая - стала зол"
    "отая,\nбыли грибки простые - стали золотые,была картошечка простая - стала золотая....\nЕле-еле водку спасли...."]

cars = {"Audi RS 6": {'cost': 10000000000, 'do100': 4.6, 'hp': 450, 'max': 250},
        "BMW M3": {'cost': 1000000000000, 'do100': 4, 'hp': 500, 'max': 300},
        "Mustang GT 500": {'cost': 10000000000000, 'do100': 3.5, 'hp': 760, 'max': 290},
        "Acura NSX": {'cost': 10000000000000, 'do100': 2.9, 'hp': 600, 'max': 300},
        "Ferrari 458 Italia": {'cost': 50000000000000, 'do100': 3.4, 'hp': 562, 'max': 325},
        "Porsche 911": {'cost': 100000000000000, 'do100': 2.7, 'hp': 470, 'max': 330},
        "Mercedes AMG GT": {'cost': 250000000000000, 'do100': 3.2, 'hp': 530, 'max': 325},
        "Bugatti Chiron": {'cost': 250000000000000, 'do100': 2.4, 'hp': 1500, 'max': 490},
        "Lamborghini Huracan": {'cost': 250000000000000, 'do100': 3.2, 'hp': 449, 'max': 325},
        "Lamborghini Urus": {'cost': 250000000000000, 'do100': 3.3, 'hp': 657, 'max': 305},
        "Mercedes G-class": {'cost': 250000000000000, 'do100': 4.5, 'hp': 430, 'max': 220},
        "Rolls-Royce Boat Tail": {'cost': 2500000000000000000000000000, 'do100': 2, 'hp': 700, 'max': 350}}

yachts = {"Ванна": 10000, "Nauticat 331": 10000000, "Nordhavn 56 MS": 15000000, "Princess 60": 25000000,
          "Azimut 70": 35000000, "Dominator 40M": 50000000, "Moonen 124": 60000000, "Wider 150": 65000000,
          "Palmer Johnson 42M SuperSport": 80000000, "Wider 165": 85000000, "Eclipse": 150000000, "Dubai": 300000000,
          "Streets of Monaco": 750000000}

airplanes = {"Параплан": 100000, "АН-2": 350000, "Cessna-172E": 700000, "Supermarine Spitfire": 1000000,
             "BRM NG-5": 1400000, "Cessna T210": 2600000, "Beechcraft 1900D": 5500000, "Cessna 550": 8000000,
             "Hawker 4000": 22400000, "Learjet 31": 45000000, "Airbus A318": 85000000, "F-35A": 160000000,
             "Boeing 747-430 Custom": 225000000, "C-17A Globemaster III": 350000000, "F-22 Raptor": 400000000,
             "Airbus 380 Custom": 600000000, "B-2 Spirit Stealth Bomber": 1359000000}

helicopters = {"Шарик с пропеллером": 2, "RotorWay Exec 162F": 300000, "Robinson R44": 450000, "Hiller UH-12C": 1300000,
               "AW119 Koala": 2500000, "MBB BK 117": 4000000, "Eurocopter EC130": 7500000,
               "Leonardo AW109 Power": 10000000, "Sikorsky S-76": 15000000, "Bell 429WLG": 19000000,
               "NHI NH90": 35000000, "Kazan Mi-35M": 60000000, "Bell V-22 Osprey": 135000000}

homes = {"Улица": 5000, "Сарай": 1000000, "Гараж": 2500000000, "Старый вагон": 10000000000,
         "Комната в общаге": 300000000000, "Квартира": 1000000000000, "Ночной клуб": 25000000000000,
         "Коттедж": 50000000000000, "Дом на рублёвке": 100000000000000, "Вилла в Испании": 500000000000000,
         "Белый дом": 750000000000000, "Moscow City": 1000000000000000, "Мальдивы": 3000000000000000}

pets = {"Улитка": 1000, "Лягушка": 25000, "Заяц": 500000, "Свинья": 300000000, "Лиса": 1250000000, "Собака": 5000000000,
        "Панда": 30000000000, "Горилла": 180000000000}

phone = {"Nokia 108": 250, "Nokia 3310": 500, "ASUS ZenFone 4": 2000, "BQ Aquaris X": 10000, "Sony Xperia XA": 15000,
         "Samsung Galaxy S8": 30000, "Xiaomi Mi Mix": 50000, "Torex FS1": 75000, "iPhone X": 100000,
         "Мегафон С1": 250000, "Samsung Z Flip": 500000, "Samsung S21 Ultra": 1000000, "Огурец": 750000000,
         "iPhone 14": 1000000000, "iPhone 14 Pro": 100000000000, "iPhone 14 Pro Max": 300000000000}

pc = {"DEXP Aquilon O175": 10000, "HYPERPC NEO": 500000, "DELL Alienware Aurora R7": 1000000,
      "HYPERPC COSMOS X 3": 3000000, "HYPERPC PREMIUM": 5000000}

potions = {"удачи": 1000000000000, "шахтера": 100000000000, "неудачи": 50000000000, "энергии": 1000000000000,
           "молоко": 1000000000, "": 1000000000}

ranks = ["Рядовой", "Ефрейтор", "Младший сержант", "Сержант", "Старший сержант", "Старшина", "Прапорщик",
         "Старший прапорщик", "Младший лейтенант", "Лейтенант", "Старший лейтенант", "Капитан", "Майор", "Подполковник",
         "Полковник", "Генерал-майор", "Генерал-лейтенант", "Генерал-полковник", "Генерал армии",
         "Главный маршал рода войск", "Маршал Советского Союза",
         "Действительный государственный советник таможенной службы",
         "Государственный советник таможенной службы 1 ранга", "Государственный советник таможенной службы II ранга",
         "Государственный советник таможенной службы III ранга", "Советник таможенной службы 1 ранга",
         "Советник таможенной службы II ранга", "Советник таможенной службы III ранга",
         "Инспектор таможенной службы 1 ранга", "Инспектор таможенной службы II ранга",
         "Инспектор таможенной службы III ранга"]

allwords = {
    3: ["Аул", "Азу", "Ату", "Ага", "Аль", "Абы", "Али", "Акт", "Аут", "Акр", "Бич", "Быт", "Бар", "Бок", "Беж", "Бук",
        "Бит", "Бык", "Бал", "Бой", "Вяз", "Вес", "Вол", "Выя", "Век", "Вой", "Вуз", "Ваш", "Воз", "Все", "Ген", "Гоп",
        "Где", "Гон", "Гам", "Гол", "Гул", "Газ", "Год", "Гуж", "Дед", "Док", "Дух", "Два", "Дож", "Дуб", "Дар", "Дог",
        "Дот", "Дно", "Ель", "Еле", "Еда", "Его", "Еще", "Ерш", "Жир", "Жэк", "Жим", "Жук", "Жар", "Жох", "Жор", "Жом",
        "Зло", "Зуд", "Зев", "Зуб", "Зам", "Зря", "Зал", "Зов", "Зад", "Зоб", "Ион", "Иже", "Имя", "Иго", "Иль", "Ива",
        "Или", "Ибо", "Икс", "Иск", "Кум", "Кит", "Ком", "Куб", "Кий", "Кол", "Кто", "Кап", "Кок", "Кош", "Лик", "Ляп",
        "Лаз", "Лом", "Лей", "Лук", "Лещ", "Люк", "Лад", "Лог", "Мой", "Мах", "Муж", "Мех", "Миф", "Мат", "Мох", "Мел",
        "Мяч", "Мир", "Нэп", "Наш", "Нос", "Нож", "Ниц", "Низ", "Нюх", "Нет", "Одр", "Орг", "Ода", "Опт", "Обо", "Оно",
        "Ото", "Оба", "Они", "Ось", "Пот", "Пай", "Пас", "Пуп", "Пир", "Пэр", "Поп", "Паз", "Пар", "Пук", "Рак", "Рык",
        "Ржа", "Род", "Рай", "Рот", "Рея", "Рог", "Раз", "Ром", "Сон", "Сам", "Сук", "Сиг", "Сэр", "Сом", "Сад", "Суд",
        "Сей", "Сыч", "Тип", "Тут", "Ток", "Тын", "Тот", "Тик", "Тур", "Тля", "Тыл", "Топ", "Ухо", "Уже", "Уха", "Уда",
        "Усы", "Угу", "Ура", "Узы", "Уют", "Ужо", "Фен", "Фат", "Фут", "Фас", "Фря", "Фал", "Фон", "Фея", "Хор", "Хам",
        "Ход", "Хна", "Хек", "Хап", "Хан", "Цыц", "Цуг", "Цех", "Цеп", "Цап", "Чин", "Чум", "Час", "Чик", "Чуб", "Чан",
        "Чиж", "Что", "Чал", "Чем", "Шов", "Шах", "Шиш", "Шут", "Шар", "Шип", "Шум", "Шаг", "Шик", "Шоу", "Щит", "Щуп",
        "Это", "Эрг", "Эра", "Эге", "Эхо", "Юрк", "Юла", "Язь", "Яга", "Ять", "Явь", "Ярд", "Ямб", "Яма"],
    4: ["Акын", "Атом", "Амба", "Адов", "Арба", "Айда", "Арык", "Альт", "Агат", "Арат", "Беда", "Блуд", "Бред", "Буфы",
        "Балл", "Било", "Боза", "Брус", "Быть", "Барк", "Ввек", "Взад", "Вниз", "Вруб", "Вязь", "Веко", "Вилы", "Воля",
        "Втуз", "Весь", "Гной", "Грач", "Гуща", "Гать", "Гонт", "Гроб", "Гипс", "Гост", "Груз", "Гнет", "Депо", "Диск",
        "Дуга", "Дюны", "Дань", "Деть", "Дока", "Дура", "Двор", "Джут", "Елей", "Есть", "Ежик", "Если", "Едок", "Ерик",
        "Едва", "Енот", "Елка", "Жара", "Жнея", "Желе", "Жила", "Жанр", "Жнец", "Жезл", "Жюри", "Жижа", "Жаль", "Злой",
        "Загс", "Зной", "Заяц", "Зубр", "Злак", "Знак", "Зато", "Зонт", "Зима", "Игла", "Ирис", "Изба", "Ишак", "Ильм",
        "Ибис", "Инок", "Идти", "Иуда", "Икры", "Кафе", "Киот", "Клык", "Корж", "Криз", "Куща", "Квит", "Клей", "Ковш",
        "Кофе", "Леди", "Лить", "Лука", "Лада", "Лето", "Ложа", "Лыко", "Ларь", "Линь", "Лорд", "Миля", "Мочь", "Мята",
        "Мама", "Мисс", "Муза", "Маца", "Морг", "Муха", "Мель", "Ниже", "Ныть", "Наст", "Нога", "Негр", "Ночь", "Нива",
        "Ныне", "Нары", "Новь", "Ожог", "Орда", "Обод", "Окот", "Оспа", "Овал", "Овес", "Оный", "Отит", "Один", "Пава",
        "Песо", "План", "Плющ", "Пояс", "Пуск", "Пари", "Пиит", "Плед", "Пока", "Раз", "Рама", "Река", "Роль", "Рыть",
        "Рань", "Риал", "Роща", "Рвач", "Ритм", "Сноб", "Спех", "Стон", "Счет", "Сват", "Семь", "Скит", "Слет", "Соло",
        "Срок", "Теля", "Тиун", "Торф", "Трус", "Тюря", "Тень", "Тога", "Трап", "Туда", "Такт", "Уезд", "Улей", "Утка",
        "Увод", "Узел", "Унты", "Уход", "Угон", "Указ", "Урок", "Фарт", "Фонд", "Фига", "Фтор", "Фифа", "Фарс", "Фойе",
        "Фетр", "Фрак", "Фита", "Хина", "Храп", "Хлоп", "Хрыч", "Хала", "Холя", "Хула", "Хвоя", "Храм", "Хлев", "Ценз",
        "Цикл", "Цена", "Циан", "Цель", "Цеце", "Цвет", "Цепь", "Цирк", "Цаца", "Чека", "Чуть", "Чета", "Чара", "Чтец",
        "Чего", "Чуни", "Черт", "Чадо", "Чрез", "Ширь", "Шпик", "Шкив", "Штат", "Шарк", "Шлюз", "Шурф", "Шейк", "Шина",
        "Шоры", "Щука", "Щепа", "Щель", "Щелк", "Щека", "Эвон", "Эфир", "Эмка", "Этак", "Эфес", "Эмир", "Этаж", "Этюд",
        "Эльф", "Эссе", "Юнец", "Юнга", "Юмор", "Юфть", "Юбка", "Юрта", "Юань", "Юный", "Янки", "Ярый", "Явор", "Ячий",
        "Ямка", "Ярус", "Явка", "Ячея", "Ялик", "Ящур"],
    5: ["Аборт", "Актер", "Амвон", "Ареал", "Атолл", "Аврал", "Алеть", "Ангар", "Армяк", "Агнец", "Бегун", "Бидон",
        "Блеск", "Бомба", "Брать", "Будто", "Бурый", "Балок", "Барыш", "Белек", "Вакса", "Вбить", "Везде", "Ветвь",
        "Взлет", "Витой", "Внове", "Война", "Вояка", "Всяко", "Гладь", "Голик", "Горох", "Груда", "Гусак", "Гашиш",
        "Герой", "Глыба", "Голье", "Грань", "Дебри", "Дефис", "Дождь", "Досье", "Дрога", "Дутье", "Давка", "Деист",
        "Динар", "Долой", "Егерь", "Егоза", "Ездок", "Есаул", "Евреи", "Ездка", "Ересь", "Евнух", "Ежиха", "Емкий",
        "Жалко", "Живот", "Жучка", "Ждать", "Жилой", "Жерех", "Жница", "Жакет", "Живой", "Жупел", "Знамя", "Задор",
        "Залом", "Засим", "Здесь", "Зубок", "Завал", "Заика", "Запад", "Затон", "Иерей", "Икота", "Исход", "Извод",
        "Интер", "Ивняк", "Излом", "Искус", "Идиот", "Икона", "Казус", "Канат", "Касса", "Кегли", "Киста", "Кляча",
        "Кокки", "Комок", "Корма", "Кошма", "Лилия", "Лишек", "Лужок", "Лямка", "Лавка", "Латук", "Лента", "Леска",
        "Линек", "Лодка", "Макет", "Манси", "Медик", "Метла", "Мишка", "Моряк", "Муляж", "Мялка", "Магма", "Малыш",
        "Нагар", "Налив", "Насос", "Некто", "Никто", "Носка", "Набег", "Наезд", "Намет", "Начес", "Обуть", "Ожить",
        "Октет", "Опара", "Орать", "Осока", "Отдых", "Отсев", "Очник", "Обить", "Проба", "Пульт", "Пьеса", "Панно",
        "Пасха", "Пенни", "Пеший", "Питон", "Плешь", "Позер", "Разом", "Рация", "Резня", "Робот", "Роман", "Рукав",
        "Рынок", "Рамка", "Рвота", "Ремиз", "Сноха", "Сопли", "Сошка", "Среди", "Стена", "Струг", "Сурок", "Сшить",
        "Сайда", "Сапер", "Тавро", "Танин", "Текст", "Тиара", "Толпа", "Трава", "Трояк", "Турки", "Таков", "Таска",
        "Уазик", "Узник", "Унять", "Утлый", "Уголь", "Уксус", "Усики", "Учить", "Ушник", "Удить", "Фазис", "Фетиш",
        "Фиорд", "Франт", "Фанза", "Фикус", "Флирт", "Фрукт", "Фаянс", "Фильм", "Халат", "Хинди", "Холст", "Хурма",
        "Хамье", "Хлюст", "Хорда", "Хвост", "Ходка", "Хохол", "Цифра", "Цевка", "Цыпки", "Цепка", "Цитра", "Цвето",
        "Цыпка", "Центр", "Циник", "Цапля", "Чекан", "Чибис", "Чудом", "Черед", "Читка", "Чулан", "Чалый", "Честь",
        "Чтиво", "Чуток", "Шагом", "Шатер", "Шерпы", "Школа", "Шпиль", "Штурм", "Шалун", "Шашка", "Ширма", "Шляпа",
        "Щетка", "Щучий", "Щегол", "Щепка", "Щиток", "Щенок", "Щипцы", "Щелок", "Щипок", "Щелка", "Эстет", "Эмаль",
        "Эскиз", "Элита", "Эркер", "Экран", "Эрзац", "Этнос", "Эклер", "Эпоха", "Юлить", "Юрист", "Юкола", "Юноша",
        "Юдоль", "Юннат", "Юнкер", "Юниор", "Юркий", "Ягода", "Якуты", "Ярыга", "Ягель", "Яхонт", "Якорь", "Ярлык",
        "Явный", "Ястык", "Якобы"]}

donate = [{"cost": 1790, "name": "ultra"}, {"cost": 1500, "name": "admin"}, {"cost": 799, "name": "premium"},
          {"cost": 299, "name": "vip"}, {"cost": 1990, "name": "ak"}, {"cost": 500, "name": "km"},
          {"cost": 399, "name": "HP Color LaserJet"}, {"cost": 199, "name": "30000000000000$"},
          {"cost": 15, "name": "15000gb"}, {"cost": 48, "name": "50000gb"}, {"cost": 95, "name": "100000gb"},
          {"cost": 235, "name": "250000gb"}, {"cost": 460, "name": "500000gb"}, {"cost": 900, "name": "1000000gb"},
          {"cost": 2250, "name": "2500000gb"}, {"cost": 5000, "name": ""}, {"cost": 1500, "name": "200e"}]

regions = [1, 48, 2, 102, 49, 3, 50, 90, 150, 4, 51, 5, 52, 6, 53, 7, 54, 154, 8, 55, 9, 56, 10, 57, 11, 58, 12, 59,
           159, 13, 60, 14, 61, 161, 15, 62, 16, 116, 63, 163, 17, 64, 18, 118, 65, 19, 66, 96, 20, 67, 21, 121, 68, 22,
           69, 23, 93, 70, 24, 71, 25, 125, 72, 26, 73, 173, 27, 74, 174, 28, 75, 29, 76, 30, 77, 31, 78, 32, 79, 33,
           80, 34, 81, 35, 82, 36, 83, 37, 84, 38, 138, 85, 39, 86, 40, 87, 41, 88, 42, 89, 43, 90, 44, 95, 45, 98, 46,
           99, 47]
